<?php
$array1 = array("蒲公英幼苗","对局内使用 增加1点友好度");
$array2 = array("白玫瑰幼苗","对局内使用 增加2点友好度");
$array3 = array("菊花幼苗","对局内使用 增加3点友好度");
$array4 = array("紫薇花幼苗","对局内使用 增加4点友好度");
$array5 = array("黑郁金香幼苗","对局内使用 增加5点友好度");
$array6 = array("团圆花幼苗","对局内使用 增加5点友好度");
$array7 = array("黑玫瑰幼苗","对局内使用 增加8点友好度");
$array8 = array("康乃馨幼苗","对局内使用 增加8点友好度");
$array9 = array("三色堇幼苗","对局内使用 增加10点友好度");
$array10 = array("向日葵幼苗","观战中使用 增加5点人气");
$array11 = array("郁金香幼苗","观战中使用 增加10点人气");
$array12 = array("茉莉花幼苗","观战中使用 增加20点人气");
$array13 = array("铃兰花幼苗","观战中使用 增加30点人气");
$array14 = array("荷花幼苗","观战中使用 增加30点人气");
$array15 = array("海棠花幼苗","观战中使用 增加40点人气");
$array16 = array("迎春花幼苗","对局外使用 玩家经验+5");
$array17 = array("水仙花幼苗","对局外使用 玩家经验+10");
$array18 = array("星舞璀璨幼苗","对局外使用 玩家经验+10");
$array19 = array("梅花幼苗","对局外使用 玩家经验+20");
$array20 = array("梅花幼苗","对局外使用 玩家经验+20");
$array21 = array("牡丹花幼苗","对局外使用 玩家经验+40");
$array22 = array("薰衣草幼苗","对局外使用 玩家经验+100");
$array23 = array("波斯菊幼苗","对局外使用 玩家经验+100");
$array24 = array("天堂鸟幼苗","对局外使用 玩家经验+100");
$array25 = array("玉兰幼苗","对局外使用 玩家经验+200");
$array26 = array("风信子幼苗","对局外使用 玩家经验+300");
$array27 = array("鸢尾花幼苗","对局外使用 玩家经验+400");
$array28 = array("摇钱树幼苗","对局外使用 玩家经验+500");
$array29 = array("月桂幼苗","对局内使用 增加4点心动值");
$array30 = array("一品红幼苗","对局内使用 增加5点心动值");
$array31 = array("百合花幼苗","对局内使用 增加10点心动值");
$array32 = array("红玫瑰幼苗","对局内使用 增加15点心动值");
$array33 = array("蝴蝶兰幼苗","对局内使用 增加20点心动值");
$array34 = array("夹竹桃幼苗","对局内使用 增加50点心动值");
$array35 = array("蓝玫瑰幼苗","对局内使用 增加50点心动值");
$array36 = array("栀子花幼苗","对局内使用 增加80点心动值");
$array37 = array("紫罗兰幼苗","对局内使用 增加100点心动值");
$array38 = array("樱花幼苗","对局内使用 增加150点心动值");
$array39 = array("雏菊幼苗","对局外使用 增加4点花房经验");
$array40 = array("藏红花幼苗","对局外使用 增加20点花房经验");
$array41 = array("火鹤花幼苗","对局外使用 增加1-10级宠物15点体力");
$array42 = array("马缨花幼苗","对局外使用 增加11-20级宠物10点体力");
$array43 = array("粉蔷薇幼苗","对局内使用 仅在豆豆对对碰中使用时 玩家花朵数+2");
for ($i = 1; $i < 44; $i ++) {
	echo "<a href=?flower=array".$i.">".${"array".$i}[0]."</a> ";
}
if (isset($_GET["flower"])) {
	$url = $_GET["flower"];
	echo "<br>";
	echo ${$url}[1];
}
?>
